## cloudtrail_data_lake plan
```
module.github-cloudtrail-auditlog.data.archive_file.github_s3_reader_function: Reading...
module.github-cloudtrail-auditlog.data.archive_file.github_ingest_function: Reading...
module.github-cloudtrail-auditlog.data.aws_region.current: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_assume_role: Reading...
module.github-cloudtrail-auditlog.data.aws_partition.current: Reading...
module.github-cloudtrail-auditlog.data.aws_caller_identity.current: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_assume_role: Reading...
module.github-cloudtrail-auditlog.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_assume_role: Read complete after 0s [id=2690255455]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_assume_role: Read complete after 0s [id=2690255455]
module.github-cloudtrail-auditlog.data.aws_partition.current: Read complete after 0s [id=aws]
module.github-cloudtrail-auditlog.data.aws_caller_identity.current: Read complete after 0s [id=880656497252]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.bucket_policy: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_encryption_key: Reading...
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.bucket_policy: Read complete after 0s [id=2608418455]
module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_encryption_key: Read complete after 0s [id=1684911374]
module.github-cloudtrail-auditlog.data.archive_file.github_s3_reader_function: Read complete after 1s [id=6a3593d7eb976b079d75240834b03b14d8943e8f]
module.github-cloudtrail-auditlog.data.archive_file.github_ingest_function: Read complete after 1s [id=ce71283a46b7b06e8f5009aa335a017e1d86bad9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_ingest_function_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_ingest_function_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowKMSToEncryptSQSMessage"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSQSReceiveMessage"
        }
      + statement {
          + actions   = [
              + "sqs:GetQueueAttributes",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSQSSendMessage"
        }
      + statement {
          + actions   = [
              + "cloudtrail-data:PutAuditEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowCloudTrailPutAudit"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubIngestFunction:*:*",
            ]
          + sid       = "AllowToWriteCloudWatchLog"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSSMParameterAccess"
        }
    }

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_function_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_s3_reader_function_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::test-github-enterprise-audit/*",
            ]
          + sid       = "AllowReadS3Bucket"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowKMSToEncryptSQSMessage"
        }
      + statement {
          + actions   = [
              + "sqs:GetQueueAttributes",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSQSSendMessage"
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSSMParameterAccess"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubS3ReaderFunction:*:*",
            ]
          + sid       = "AllowToWriteCloudWatchLog"
        }
    }

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_s3_reader_queue" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowOwner"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::880656497252:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonHTTPS"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_s3_reader_queue_dlq will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_s3_reader_queue_dlq" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowOwner"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::880656497252:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonHTTPS"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.github-cloudtrail-auditlog.data.aws_iam_policy_document.github_transform_dlq will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_transform_dlq" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowOwner"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::880656497252:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "SQS:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonHTTPS"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.github-cloudtrail-auditlog.aws_cloudwatch_log_group.github_ingest_loggroup will be created
  + resource "aws_cloudwatch_log_group" "github_ingest_loggroup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/GitHubIngestFunction"
      + name_prefix       = (known after apply)
      + retention_in_days = 120
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_cloudwatch_log_group.github_s3_reader_loggroup will be created
  + resource "aws_cloudwatch_log_group" "github_s3_reader_loggroup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/GitHubS3ReaderFunction"
      + name_prefix       = (known after apply)
      + retention_in_days = 120
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_iam_role.github_ingest will be created
  + resource "aws_iam_role" "github_ingest" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "GitHub Ingest Lambda Function IAM Role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubIngestFunctionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "github_ingest_function_policy"
          + policy = (known after apply)
        }
    }

  # module.github-cloudtrail-auditlog.aws_iam_role.github_s3_reader will be created
  + resource "aws_iam_role" "github_s3_reader" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "GitHub S3 Reader Lambda Function IAM Role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubS3ReaderFunctionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "github_s3_reader_policy"
          + policy = (known after apply)
        }
    }

  # module.github-cloudtrail-auditlog.aws_kms_alias.github_encryption_key will be created
  + resource "aws_kms_alias" "github_encryption_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/GitHubCloudTrailOpenEvent"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_kms_key.github_encryption_key will be created
  + resource "aws_kms_key" "github_encryption_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key to encrypt all content in the SQS for GitHub Lambda function integration"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:ReEncrypt*",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:Get*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Decrypt",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::880656497252:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:Describe",
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = [
                                  + "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubS3ReaderFunction",
                                  + "arn:aws:logs:eu-west-2:880656497252:log-group:/aws/lambda/GitHubIngestFunction",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.eu-west-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Service CloudWatchLogGroup"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_lambda_event_source_mapping.github_s3_reader_queue_to_lambda will be created
  + resource "aws_lambda_event_source_mapping" "github_s3_reader_queue_to_lambda" {
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = (known after apply)
      + function_arn                       = (known after apply)
      + function_name                      = "GitHubIngestFunction"
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_lambda_function.github_ingest will be created
  + resource "aws_lambda_function" "github_ingest" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Read GitHub Audit log events, transform and push it to CloudTrail Open Audit"
      + filename                       = "lambdas/cloudtrail-ingest.zip"
      + function_name                  = "GitHubIngestFunction"
      + handler                        = "cloudtrail-ingest.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 10
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "vtOEv8NQZG1O8qG708wFtcvuKml/s4G2Kh78mizwcDw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # module.github-cloudtrail-auditlog.aws_lambda_function.github_s3_reader will be created
  + resource "aws_lambda_function" "github_s3_reader" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Read S3 bucket containing GitHub Audit Log and filter and send result to SQS for batch update to CloudTrail"
      + filename                       = "lambdas/s3-reader.zip"
      + function_name                  = "GitHubS3ReaderFunction"
      + handler                        = "s3-reader.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 10
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "NEVVwZWzMI1VRAn6XjPcerdoWsP3STrjWKC/VTNWqZ8="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # module.github-cloudtrail-auditlog.aws_lambda_permission.github_ingest_function_event will be created
  + resource "aws_lambda_permission" "github_ingest_function_event" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_account      = "880656497252"
      + source_arn          = "arn:aws:s3:::test-github-enterprise-audit"
      + statement_id        = "GitHubIngestFunctionEvent"
      + statement_id_prefix = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_lambda_permission.github_s3_reader_function_event will be created
  + resource "aws_lambda_permission" "github_s3_reader_function_event" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_account      = "880656497252"
      + source_arn          = "arn:aws:s3:::test-github-enterprise-audit"
      + statement_id        = "GitHubS3ReaderFunctionEvent"
      + statement_id_prefix = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue.github_s3_reader_dlq will be created
  + resource "aws_sqs_queue" "github_s3_reader_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "GitHubS3ReaderDLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue.github_s3_reader_queue will be created
  + resource "aws_sqs_queue" "github_s3_reader_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "GitHubS3ReaderQueue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue.github_transform_dlq will be created
  + resource "aws_sqs_queue" "github_transform_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "githubTransformDLQ.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_s3_reader_dlq will be created
  + resource "aws_sqs_queue_policy" "github_s3_reader_dlq" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_s3_reader_queue will be created
  + resource "aws_sqs_queue_policy" "github_s3_reader_queue" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_sqs_queue_policy.github_transform_dlq will be created
  + resource "aws_sqs_queue_policy" "github_transform_dlq" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_ssm_parameter.github_audit_allow_list will be created
  + resource "aws_ssm_parameter" "github_audit_allow_list" {
      + arn            = (known after apply)
      + data_type      = "text"
      + description    = "Allow list of GitHub Audit event for ingestion to CloudTrail Open Audit"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/github/GitHubAuditAllowList"
      + tags_all       = (known after apply)
      + tier           = "Intelligent-Tiering"
      + type           = "StringList"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.github-cloudtrail-auditlog.aws_ssm_parameter.github_cloudtrail_channel will be created
  + resource "aws_ssm_parameter" "github_cloudtrail_channel" {
      + arn            = (known after apply)
      + data_type      = "text"
      + description    = "CloudTrail Lake Channel ARN for GitHub audit log integration"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/github/GitHubCloudTrailChannel"
      + tags_all       = (known after apply)
      + tier           = "Intelligent-Tiering"
      + type           = "StringList"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```